# Parameters
nc: 11 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Focus, [64, 3]] # 0-P1/2
  - [-1, 1, DWConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, DWConv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [768, 3, 2]] # 7-P5/32
  - [-1, 6, C2f, [768, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 9-P5/64
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 1, PSA, [1024]] # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P5
  - [-1, 3, C2, [768]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2, [512]]  # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2, [256]]  # 21 (P3/8-small)

  - [-1, 1, DWConv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2, [256]]  # 24 (P4/16-medium)

  - [-1, 1, DWConv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2, [512]]  # 27 (P5/32-large)

  - [-1, 1, DWConv, [768, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P6
  - [-1, 3, C2fCIB, [1024, True, True]]  # 30 (P6/64-xlarge)

  - [[21, 24, 27, 30], 1, v10Detect, [nc]]  # Detect(P3, P4, P5, P6)

